title: Query Credentials in Registry
description: Query Credentials in Registry
author: Emir Erdogan
status: experimental
logsource:
  product: windows
  service: sysmon
tags:
- attack.T1214
detection:
  selection:
    ParentImage:
    - C:\Windows\System32\cmd.exe
    Image:
    - C:\Windows\System32\reg.exe
    CommandLine:
    - reg query HKCU /f password /t REG_SZ /s
    - reg query HKLM /f password /t REG_SZ /s
  condition: selection
falsepositives:
- unknwon
level: critical
